print("Добрий день. Мене звати Діма.")
name = input("Як я можу до вас звертатися? ")
print(f"Дуже приємно, {name}.")

kind_classes = input("Скажіть, будь ласка, вас цікавлять заняття онлайн чи оффлайн? ")

o = "онлайн"

if kind_classes == o:
    print("В нас зараз триває такий набір на заняття онлайн.")

elif kind_classes == "оффлайн" or kind_classes == "офлайн":
    print("Напишіть, з якого ви міста?")

    cities = input("Моє місто це: ")

    if cities == "Вроцлав" or cities == "вроцлав":
        print(f"У місті {cities} в нас зараз тривають 2 набори на початковий рівень.")
    elif cities == "Познань" or cities == "познань":
        print(f"У місті {cities} в нас зараз триває набір на заняття по неділях.")
    else:
        print(input("На жаль у вашому місті в нас зараз немає курсів оффлайн. Чи ви розважаєте навчаня онлайн? "))
        answer_online = input("Введіть ТАК або НІ: ")

        if answer_online == "так":
            print("Добре") #подумати, що зробити
        elif answer_online == "ні":
            print("Нам шкода, що ми не можемо нічого вам запропонувати.")
        
else:
    print("Впишіть, будь ласка, одне з двух: вас цікавлять заняття ОНЛАЙН або ОФФЛАЙН?")
    
print("Гарного дня")







    
          
    
