print("Добрий день. Мене звати Діма.")
name = input("Як я можу до вас звертатися? ")
print(f"Дуже приємно, {name}.")

kind_classes = input("Скажіть, будь ласка, вас цікавлять заняття онлайн чи оффлайн? ")

if kind_classes == "онлайн":
    print("В нас зараз триває такий набір на заняття онлайн.")
elif kind_classes == "оффлайн" or "офлайн":
    print(input("Напишіть, з якого ви міста? "))
else:
    print("Впишіть, будь ласка, одне з двух: вас цікавлять заняття ОНЛАЙН або ОФФЛАЙН?")
    
print("Гарного дня")

# if cities == "Вроцлав" or "вроцлав":
#     print("У Вроцлаві в нас зараз тривають 2 набори на початковий рівень.")
# elif cities == "Познань" or "познань":
#     print("У Познані в нас зараз триває набір на заняття по неділях.")
# else:
#     print(input("На жаль у вашому місті в нас зараз немає курсів оффлайн. Чи ви розважаєте навчаня онлайн? "))





    
          
    
